[{"Title": "NASA's Perseverance Rover Will Peer Beneath Mars' Surface ", "Preview": "The agency's newest rover will use the first ground-penetrating radar instrument on the Martian surface to help search for signs of past microbial life. "}, {"Title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "Preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"Title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "Preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "}, {"Title": "NASA's Perseverance Rover Mission Getting in Shape for Launch", "Preview": "Stacking spacecraft components on top of each other is one of the final assembly steps before a mission launches to the Red Planet. "}, {"Title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "Preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"Title": "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet", "Preview": "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021. "}, {"Title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "Preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"Title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "Preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"Title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "Preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"Title": "NASA's Perseverance Rover Attached to Atlas V Rocket", "Preview": "Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."}, {"Title": "Celebrate Mars Reconnaissance Orbiter's Views From Above", "Preview": "Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."}, {"Title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "Preview": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"Title": "New Selfie Shows Curiosity, the Mars Chemist", "Preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."}, {"Title": "From JPL's Mailroom to Mars and Beyond", "Preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"Title": "NASA's New Mars Rover Is Ready for Space Lasers", "Preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}]